accstarkam.ОбменМагистральБП/src/DataProcessors/МС_ПараметрыПодключения/МС_ПараметрыПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МС_ПараметрыПодключения</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>APIkey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

accstarkam.ОбменМагистральБП/src/DataProcessors/МС_ПараметрыПодключения/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрыПодключения = МС_МодульОбменаВызовСервера.ПараметрыПодключения();
	Если ПараметрыПодключения <> Неопределено Тогда
		Объект.АдресСервера = ПараметрыПодключения.АдресСервера;
		Объект.APIkey = ПараметрыПодключения.APIkey;
		Объект.ИДБазы = ПараметрыПодключения.ИДБазы;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаписатьНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыПодключения = Новый Структура("АдресСервера, APIkey, ИДБазы", 
		Объект.АдресСервера, Объект.APIkey, Объект.ИДБазы);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		"ПараметрыПодключенияМагистральСтаркам", ПараметрыПодключения);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
